
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.Зарплата.Очистить();
	Движения.Зарплата.Записывать = Истина;
	Движения.Управленческий.Очистить();
	Движения.Управленческий.Записывать = Истина;
	
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.Начисления.ПремияПроцентом;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.ПериодДействияНачало = НачалоМесяца(ЗаМесяц);
		Движение.ПериодДействияКонец = КонецМесяца(ЗаМесяц);
		Движение.БазовыйПериодНачало = НачалоМесяца(ЗаМесяц);
		Движение.БазовыйПериодКонец = КонецМесяца(ЗаМесяц);
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
	КонецЦикла; 
	
	Движения.Зарплата.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗарплатаБазаЗарплата.НомерСтроки КАК НомерСтроки,
	               |	ЗарплатаБазаЗарплата.СуммаБаза КАК СуммаБаза
	               |ИЗ
	               |	РегистрРасчета.Зарплата.БазаЗарплата(
	               |			&Измерения,
	               |			&Измерения,
	               |			,
	               |			Регистратор = &Регистратор
	               |				И ВидРасчета = &ВидРасчета) КАК ЗарплатаБазаЗарплата"; 
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.Начисления.ПремияПроцентом);
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);
	База = Запрос.Выполнить().Выбрать();
	
	Пока База.Следующий() Цикл
		Движение = Движения.Зарплата[База.НомерСтроки - 1];
		Движение.Сумма = База.СуммаБаза * Процент / 100;
		
		Проводка = Движения.Управленческий.Добавить();
		Проводка.Период = Дата;
		Проводка.СчетДт = ПланыСчетов.Управленческий.Расходы;
		Проводка.СчетКт = ПланыСчетов.Управленческий.РасчетыССотрудниками;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Сотрудники] = Движение.Сотрудник;
		Проводка.Сумма = Движение.Сумма;
	КонецЦикла;
	
	Движения.Зарплата.Записать(, Истина);
	

КонецПроцедуры
