
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Управленческий.Очистить();
	Движения.Зарплата.Очистить();
	Движения.Управленческий.Записывать = Истина;
	Движения.Зарплата.Записывать = Истина;
	
	Для Каждого Строка Из Сотрудники Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = НачалоМесяца(ЗаМесяц);
		Движение.ПериодДействияКонец = КонецМесяца(ЗаМесяц);
		Движение.ВидРасчета = ПланыВидовРасчета.Начисления.ОплатаПоОкладу;
		Движение.Сотрудник = Строка.Сотрудник;
	КонецЦикла;
	
	Движения.Зарплата.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	Сотрудники.Ссылка КАК Сотрудник,
					|	Сотрудники.Оклад КАК Оклад
					|ПОМЕСТИТЬ ВТ_ОкладДокумент
					|ИЗ
					|	Документ.НачислениеОплатыПоОкладу.Сотрудники КАК НачислениеОплатыПоОкладуСотрудники
					|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
					|		ПО НачислениеОплатыПоОкладуСотрудники.Сотрудник = Сотрудники.Ссылка
					|ГДЕ
					|	НачислениеОплатыПоОкладуСотрудники.Ссылка = &Ссылка
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ_ОкладДокумент.Сотрудник КАК Сотрудник,
					|	ВТ_ОкладДокумент.Оклад КАК Оклад,
					|	ЗарплатаДанныеГрафика.НомерСтроки КАК НомерСтроки,
					|	ЕСТЬNULL(ЗарплатаДанныеГрафика.РабочийДеньПериодДействия, 0) КАК План,
					|	ЕСТЬNULL(ЗарплатаДанныеГрафика.РабочийДеньФактическийПериодДействия, 0) КАК Факт,
					|	ЗарплатаДанныеГрафика.ВидРасчета КАК ВидРасчета
					|ИЗ
					|	ВТ_ОкладДокумент КАК ВТ_ОкладДокумент
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Зарплата.ДанныеГрафика(ВидРасчета = &Оклад) КАК ЗарплатаДанныеГрафика
					|		ПО ВТ_ОкладДокумент.Сотрудник = ЗарплатаДанныеГрафика.Сотрудник
					|ГДЕ
					|	ЗарплатаДанныеГрафика.ПериодДействияНачало = &ПериодДействияНачало
					|	И ЗарплатаДанныеГрафика.ПериодДействияКонец = &ПериодДействияКонец"; 
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.Начисления.ОплатаПоОкладу);
	Запрос.УстановитьПараметр("ПериодДействияНачало", НачалоМесяца(ЗаМесяц));
	Запрос.УстановитьПараметр("ПериодДействияКонец", КонецМесяца(ЗаМесяц));
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Факт) Или Не ЗначениеЗаполнено(Выборка.План) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Отсутствуют данные графика";
			Сообщение.Сообщить();
			Отказ = Истина;
		Иначе
			Движение = Движения.Зарплата[Выборка.НомерСтроки - 1];
			Движение.Сумма = Выборка.Оклад * Выборка.Факт / Выборка.План;
			
			Проводка = Движения.Управленческий.Добавить();
			Проводка.Период = Дата;
			Проводка.СчетДт = ПланыСчетов.Управленческий.Расходы;
			Проводка.СчетКт = ПланыСчетов.Управленческий.РасчетыССотрудниками;
			Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Сотрудники] = Выборка.Сотрудник;
			Проводка.Сумма = Движение.Сумма;
		КонецЕсли;	
	КонецЦикла;
		
	
КонецПроцедуры
