
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Зарплата и управленческий
	Движения.Зарплата.Очистить();
	Движения.Управленческий.Очистить();
	Движения.Управленческий.Записывать = Истина;
	
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = Начисление;
		Движение.ПериодДействияНачало = НачалоПериодаДействия;
		Движение.ПериодДействияКонец = КонецПериодаДействия;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.Сумма = ТекСтрокаСотрудники.Сумма;
		
		Проводка =Движения.Управленческий.Добавить();
		Проводка.Период = Дата;
		Проводка.СчетДт = ПланыСчетов.Управленческий.Расходы;
		Проводка.СчетКт = ПланыСчетов.Управленческий.РасчетыССотрудниками;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Сотрудники] = ТекСтрокаСотрудники.Сотрудник;
		Проводка.Сумма = ТекСтрокаСотрудники.Сумма;
	КонецЦикла;
	
	Движения.Зарплата.Записать();
	
КонецПроцедуры
