
Функция ЦенаНаДату(Номенклатура, Дата) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
				|	ЦеныСрезПоследних.Цена КАК Цена
				|ИЗ
				|	РегистрСведений.Цены.СрезПоследних(&Дата, Номенклатура = &Номенклатура) КАК ЦеныСрезПоследних";

	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции

Функция СкидкаНаДату(Номенклатура, Дата) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СкидкиСрезПоследних.Скидка КАК Скидка
	               |ИЗ
	               |	РегистрСведений.Скидки.СрезПоследних(&Дата, НоменклатураНоменклатурнаяГруппа = &Номенклатура) КАК СкидкиСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	СкидкиСрезПоследних.Скидка КАК Скидка
		               |ИЗ
		               |	РегистрСведений.Скидки.СрезПоследних(
		               |			&Дата,
		               |			НоменклатураНоменклатурнаяГруппа В
		               |				(ВЫБРАТЬ
		               |					НоменклатурныеГруппы.Ссылка КАК Ссылка
		               |				ИЗ
		               |					Справочник.Номенклатура КАК Номенклатура
		               |						ПОЛНОЕ СОЕДИНЕНИЕ Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
		               |						ПО
		               |							Номенклатура.НоменклатурнаяГруппа = НоменклатурныеГруппы.Ссылка
		               |				ГДЕ
		               |					Номенклатура.Ссылка = &Номенклатура)) КАК СкидкиСрезПоследних"; 
		
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
		Результат = Запрос.Выполнить();
	КонецЕсли;

	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий()Тогда
		Возврат Выборка.Скидка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции




























