
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда
		Элементы.КПП.Видимость = Истина;
	ИначеЕсли Объект.Тип = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
		Элементы.КПП.Видимость = Ложь;
	Иначе
		ТекстСообщения = "Не выбран тип контрагента";
		Сообщить(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда
		Элементы.КПП.Видимость = Истина;
	ИначеЕсли Объект.Тип = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
		Элементы.КПП.Видимость = Ложь;
	Иначе
		ТекстСообщения = "Не выбран тип контрагента";
		Сообщить(ТекстСообщения);
	КонецЕсли; 
	
	КонецПроцедуры    

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если АвтоматическоеЗаполнение Или Не ЗначениеЗаполнено(Объект.ПолноеНаименование) Тогда
	Объект.ПолноеНаименование = РазвернутыеОПФ(Объект.Наименование);
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Функция РазвернутыеОПФ(Наименование) 
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
        Возврат "";
	КонецЕсли; 
	
	Наименование = СокрЛП(Наименование);
	НаименованиеМассив = СтрРазделить(Наименование, " ,.!;:?*)(«»" + Символы.ПС, Ложь);
	
	ОПФ = Новый Соответствие;
	ОПФ.Вставить("АО", "Акционерное общество");
	ОПФ.Вставить("ПАО", "Публичное акционерное общество");
	ОПФ.Вставить("ЗАО", "Закрытое акционерное общество");
	ОПФ.Вставить("ООО", "Общество с ограниченной ответственностью");
	ОПФ.Вставить("ИП", "Индивидуальный предприниматель");
	ОПФ.Вставить("НКО", "Некоммерческая организация");
	ОПФ.Вставить("ГУП", "Государственное унитарное предприятие");
	ОПФ.Вставить("МУП", "Муниципальное унитарное предприятие"); 
	
	ПолноеНаименованиеМассив = Новый Массив;
	
	Для Каждого Слово Из НаименованиеМассив Цикл
		РазвернутыйОПФ = ОПФ.Получить(Слово);
		Если РазвернутыйОПФ <> Неопределено Тогда
			ПолноеНаименованиеМассив.Добавить(РазвернутыйОПФ);
		Иначе
			ПолноеНаименованиеМассив.Добавить(Слово);
		КонецЕсли;
	КонецЦикла;
	
	ПолноеНаименование = СтрСоединить(ПолноеНаименованиеМассив, " ");
	Возврат ПолноеНаименование;

КонецФункции 


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.Тип) Тогда
		ТекстСообщения = "Не выбран тип контрагента";
		Сообщить(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ВалидацияИНН.ПроверитьИНН(Объект.ИНН, Объект.Тип) Тогда
		Отказ = Истина;
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	Если Не ВалидацияИНН.ПроверитьИНН(Объект.ИНН, Объект.Тип) Тогда
		Элементы.ИНН.ЦветТекста = WebЦвета.Красный;
	Иначе 
		Элементы.ИНН.ЦветТекста = WebЦвета.Черный;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если Объект.ПолноеНаименование = РазвернутыеОПФ(Объект.Наименование) Тогда
		АвтоматическоеЗаполнение = Истина;
	Иначе
		АвтоматическоеЗаполнение = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолноеНаименованиеПриИзменении(Элемент)
	АвтоматическоеЗаполнение = Ложь;
КонецПроцедуры











