
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	Дата = ТекущаяДата();
	
КонецПроцедуры 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Сумма = ТоварыИУслуги.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
		
	Если ТоварыИУслуги.Количество() = 0 Тогда
		Отказ = Истина;
		Сообщить("В документе отсутсвует номенклатура");
	КонецЕсли;
	
	Для Каждого Строка Из ТоварыИУслуги Цикл
		Если Строка.Количество <= 0 Тогда
			Отказ = Истина;
			Сообщить(СтрШаблон("Не указано количество товара в строке %1", Строка.НомерСтроки));
		КонецЕсли;
	КонецЦикла;
	
	Движения.Управленческий.Записывать = Истина;
	Движения.Управленческий.Очистить();
	Движения.Товары.Очистить();
	Движения.Товары.Записать();
	Движения.ВзаиморасчётыСКонтрагентами.Очистить();
	Движения.ВзаиморасчётыСКонтрагентами.Записать();
	Движения.ВзаиморасчётыСКонтрагентами.Записывать = Истина;
	Движения.Товары.Записывать = Истина;
	Движения.Расходы.Записывать = Истина;
	Движения.Доходы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура КАК Номенклатура,
	               |	СУММА(РеализацияТоваровИУслугТоварыИУслуги.Количество) КАК Количество,
	               |	СУММА(РеализацияТоваровИУслугТоварыИУслуги.Сумма) КАК Сумма,
	               |	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура.Тип КАК Тип
	               |ПОМЕСТИТЬ ВТ_ДанныеДокумента
	               |ИЗ
	               |	Документ.РеализацияТоваровИУслуг.ТоварыИУслуги КАК РеализацияТоваровИУслугТоварыИУслуги
	               |ГДЕ
	               |	РеализацияТоваровИУслугТоварыИУслуги.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура,
	               |	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура.Тип
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеДокумента.Номенклатура КАК Номенклатура,
	               |	ВТ_ДанныеДокумента.Количество КАК Количество,
	               |	ВТ_ДанныеДокумента.Сумма КАК Сумма,
	               |	ВТ_ДанныеДокумента.Тип КАК Тип,
	               |	ЕСТЬNULL(ТоварыОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокТовары,
	               |	ЕСТЬNULL(ТоварыОстатки.СуммаОстаток, 0) КАК СуммаОстатокТовары,
	               |	ЕСТЬNULL(УправленческийОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокБух,
	               |	ЕСТЬNULL(УправленческийОстатки.СуммаОстаток, 0) КАК СуммаОстатокБух
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Товары.Остатки(&Период, ) КАК ТоварыОстатки
	               |		ПО ВТ_ДанныеДокумента.Номенклатура = ТоварыОстатки.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(
	               |				&Период,
	               |				Счет = &СчетТовары,
	               |				,
	               |				Субконто1 В
	               |					(ВЫБРАТЬ
	               |						ВТ_ДанныеДокумента.Номенклатура КАК Номенклатура
	               |					ИЗ
	               |						ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)) КАК УправленческийОстатки
	               |		ПО ВТ_ДанныеДокумента.Номенклатура = УправленческийОстатки.Субконто1";


	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", МоментВремени()); 
	Запрос.УстановитьПараметр("СчетТовары", ПланыСчетов.Управленческий.Товары);
	Выборка = Запрос.Выполнить().Выбрать();
    
	 //регистр ВзаиморасчётыСКонтрагентами Расход
    Движение = Движения.ВзаиморасчётыСКонтрагентами.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.Период = Дата;
    Движение.Контрагент = Покупатель;
    Движение.Сумма = Сумма; 
	
	// Проводка Дт62 Кт90.1
	Проводка = Движения.Управленческий.Добавить();
	Проводка.Период = Дата;
	Проводка.Активность = Истина;
	Проводка.СчетДт = ПланыСчетов.Управленческий.РасчетыСПокупателями;
	Проводка.СчетКт = ПланыСчетов.Управленческий.Выручка;
	Проводка.Сумма = ТоварыИУслуги.Итог("Сумма");
	Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Покупатель;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Тип = Перечисления.ТипыНоменклатуры.Товар Тогда
			Если Выборка.Количество > Выборка.КоличествоОстатокТовары Тогда
				Недостаток = Выборка.Количество - Выборка.КоличествоОстатокТовары;
				Сообщить(СтрШаблон("*РЕГИСТР НАКОПЛЕНИЯ ТОВАРЫ* На складе недостаточно товара %1, не хватает %2",Выборка.Номенклатура, Недостаток));
				Отказ = Истина;
				Продолжить;
			КонецЕсли;
			
			Если Выборка.Количество > Выборка.КоличествоОстатокБух Тогда
				Недостаток = Выборка.Количество - Выборка.КоличествоОстатокБух;
				Сообщить(СтрШаблон("*РЕГИСТР БУХГАЛТЕРИИ* На складе недостаточно товара %1, не хватает %2",Выборка.Номенклатура, Недостаток));
				Отказ = Истина;
				Продолжить;
			КонецЕсли;
			
			Если Выборка.КоличествоОстатокТовары <> Выборка.КоличествоОстатокБух Тогда
				Сообщить(СтрШаблон("Расхождение в регистрах по остаткам товара %1. РЕГИСТР НАКОПЛЕНИЯ ТОВАРЫ = %2. РЕГИСТР БУХГАЛТЕРИИ = %3.", 
						Выборка.Номенклатура, 
						Выборка.КоличествоОстатокТовары,
						Выборка.КоличествоОстатокБух));
			КонецЕсли;
					
			
			Если Выборка.Количество = Выборка.КоличествоОстатокТовары Тогда
				СебестоимостьТовары = Выборка.СуммаОстатокТовары;
				СебестоимостьБух = Выборка.СуммаОстатокБух;
			Иначе
				СебестоимостьТовары = Выборка.Количество * Выборка.СуммаОстатокТовары / Выборка.КоличествоОстатокТовары;
				СебестоимостьБух = Выборка.Количество * Выборка.СуммаОстатокБух / Выборка.КоличествоОстатокБух;
			КонецЕсли;
			//регистр Товары
			Движение = Движения.Товары.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Количество = Выборка.Количество;
			Движение.Сумма = СебестоимостьТовары;
			//регистр расходы
			ДвижениеРасходы = Движения.Расходы.Добавить();
			ДвижениеРасходы.Период = Дата;
			ДвижениеРасходы.Номенклатура = Выборка.Номенклатура;
			ДвижениеРасходы.Сумма = СебестоимостьТовары;
			// Регистр бухгалтерии дт90 кт41
			Проводка = Движения.Управленческий.Добавить();
			Проводка.Период = Дата;
			Проводка.Активность = Истина;
			Проводка.СчетДт = ПланыСчетов.Управленческий.Расходы;
			Проводка.СчетКт = ПланыСчетов.Управленческий.Товары;
			Проводка.Сумма = СебестоимостьБух;	
			Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
			Проводка.КоличествоКт = Выборка.Количество;
		КонецЕсли; 
		
		Движение = Движения.Доходы.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Количество = Выборка.Количество;
		Движение.Сумма = Выборка.Сумма;
		
	КонецЦикла;

КонецПроцедуры 







