
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	Дата = ТекущаяДата();
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВзаиморасчётыСКонтрагентами.Очистить();
	Движения.ВзаиморасчётыСКонтрагентами.Записать();
	Движения.ВзаиморасчётыСКонтрагентами.Записывать = Истина;
	Движения.Управленческий.Очистить();
	Движения.Управленческий.Записывать = Истина;

	
	//Проводка Дт50 Кт62 и Дт50 Кт70 и если тип Контрагент то записываем движение в регистр ВзаиморасчетыСКонтрагентами
	Проводка = Движения.Управленческий.Добавить();
	Проводка.Период = Дата;
	Проводка.СчетДт = ПланыСчетов.Управленческий.ДенежныеСредства;
	Проводка.Сумма = Сумма;
	
	Если ТипЗнч(Плательщик) = Тип("СправочникСсылка.Контрагенты") Тогда
		Проводка.СчетКт = ПланыСчетов.Управленческий.РасчетыСПокупателями;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Плательщик;
		
		Движение = Движения.ВзаиморасчётыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Плательщик;
		Движение.Сумма = Сумма; 

	ИначеЕсли ТипЗнч(Плательщик) = Тип("СправочникСсылка.Сотрудники") Тогда
		Проводка.СчетКт = ПланыСчетов.Управленческий.РасчетыССотрудниками;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Сотрудники] = Плательщик;
	КонецЕсли;
	
			
КонецПроцедуры

