Функция ПроверитьИНН( Знач ИНН, Знач Тип) Экспорт
	
	Если Не ЗначениеЗаполнено(ИНН) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Не ТолькоЦифры.ТолькоЦифрыВСтроке(ИНН) Тогда
		ТекстСообщения = НСтр("ru = 'ИНН должен состоять только из цифр'");      
		Сообщить(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	ЮрЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо");
	ФизЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо"); 
	
	Если Тип = ЮрЛицо Тогда
		Если СтрДлина(ИНН) <> 10 Тогда
			ТекстСообщения = НСтр("ru = 'Для юридического лица ИНН должен содержать 10 знаков'");
			Сообщить(ТекстСообщения);
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли Тип = ФизЛицо Тогда
		Если СтрДлина(ИНН) <> 12 Тогда
			ТекстСообщения = НСтр("ru = 'Для физического лица ИНН должен содержать 12 знаков'");
			Сообщить(ТекстСообщения);
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Не РаботаСИНН.ИННВерен(ИНН) Тогда
		ТекстСообщения = НСтр("ru = 'Контрольная сумма ИНН не совпадает! Проверьте правильность ввода.'");
		Сообщить(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли; 
	
	Возврат Истина;

	
КонецФункции
