
&НаКлиенте
Процедура СлучайныйПароль(Команда)
	
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	СимволыПароля = "qwertyuiopasdfghjklzxcvbnmQWERTYUIOPASDFGHJKLZXCVBNM1234567890";
	КоличествоСимволов = СтрДлина(СимволыПароля);
	Пароль = "";
	
	Для Сч = 1 по 6 Цикл
		Пароль = Пароль + Сред(СимволыПароля, ГСЧ.СлучайноеЧисло(1, КоличествоСимволов), 1);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);
	
	Если Пользователь <> Неопределено И Пользователь.АутентификацияСтандартная = Истина Тогда 
		ИмяДляВхода = Пользователь.Имя;
		Пароль = "";
		ВходРазрешен = Истина;
	ИначеЕсли Пользователь = Неопределено Или Пользователь.АутентификацияСтандартная = Ложь Тогда
		ИмяДляВхода = "";
		Пароль = "";
		ВходРазрешен = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);
	
	Если Пользователь = Неопределено И ВходРазрешен И ЗначениеЗаполнено(ИмяДляВхода) Тогда
		НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовыйПользователь.АутентификацияСтандартная = ВходРазрешен;
		НовыйПользователь.Имя = ИмяДляВхода;
		НовыйПользователь.ПолноеИмя = ТекущийОбъект.Наименование;
		НовыйПользователь.Пароль = Пароль;
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.БазовыеПрава);
		НовыйПользователь.Записать();
		
		ТекущийОбъект.ИдентификаторПользователяИБ = НовыйПользователь.УникальныйИдентификатор; 
		
	ИначеЕсли Пользователь <> Неопределено Тогда
		Пользователь.Имя = ИмяДляВхода;
		Пользователь.ПолноеИмя = ТекущийОбъект.Наименование;
		Если ЗначениеЗаполнено(Пароль) Тогда
			Пользователь.Пароль = Пароль;
		КонецЕсли;
		Пользователь.АутентификацияСтандартная = ВходРазрешен;
		Пользователь.Записать();
		
	КонецЕсли;

КонецПроцедуры
