
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	//УникальныйИдентификатор = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
	//ПараметрыСеанса.ТекущийСотрудник = Справочники.Сотрудники.НайтиПоРеквизиту("ИдентификаторПользователяИБ", УникальныйИдентификатор);
	ПолноеИмяТекущегоПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	ПараметрыСеанса.ТекущийСотрудник = Справочники.Сотрудники.НайтиПоНаименованию(ПолноеИмяТекущегоПользователя);
	
	
КонецПроцедуры
