

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Пользователь = Неопределено;
	
	
	Если ТекущийОбъект.ИдентификаторПользователяИБ <> Неопределено Тогда
		Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);
	КонецЕсли;
	
		Если Пользователь <> Неопределено И Пользователь.АутентификацияСтандартная Тогда 
		ТекущийОбъект.ИмяДляВхода = Пользователь.Имя;
		ТекущийОбъект.Пароль = "";
		ТекущийОбъект.ВходРазрешен = Истина;
	Иначе
		ТекущийОбъект.ВходРазрешен = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТестПустогоИдентификатора(Команда)
	
	//УникальныйИдент = Новый УникальныйИдентификатор("d794e693-ad91-458a-b6cc-40af44345ff4"); // тест Иванова
	
	ТекущийОбъект = Новый Структура;
	ТекущийОбъект.Вставить("ИмяДляВхода", "Василич");
	ТекущийОбъект.Вставить("Пароль", "123");
	ТекущийОбъект.Вставить("ИдентификаторПользователяИБ", Неопределено);  // УникальныйИдент для Ivanov
	ТекущийОбъект.Вставить("ВходРазрешен", Неопределено);
	
	ПриЧтенииНаСервере(ТекущийОбъект);
		
	Сообщить("Имя для входа: " + ТекущийОбъект.ИмяДляВхода);
	Сообщить("Пароль: " + ТекущийОбъект.Пароль);
	Сообщить("Вход разрешен: " + ТекущийОбъект.ВходРазрешен);
	
КонецПроцедуры


&НаСервере
Процедура ПоказатьИдентификаторНаСервере()
	Пользователи = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого Пользователь Из Пользователи Цикл
		Сообщить("Имя " + Пользователь.Имя);
		Сообщить("Номер " + Пользователь.УникальныйИдентификатор);
		Сообщить("Аутентификаци " + Пользователь.АутентификацияСтандартная);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьИдентификатор(Команда)
	ПоказатьИдентификаторНаСервере();
КонецПроцедуры

