
&НаСервере
Процедура ПринятьКИсполнениюНаСервере(Задача)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задача.Выполнена КАК Выполнена,
		|	Задача.Исполнитель КАК Исполнитель
		|ИЗ
		|	Задача.Задача КАК Задача
		|ГДЕ
		|	Задача.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Следующий() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрана задача";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если ВыборкаДетальныеЗаписи.Выполнена Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Задача %1 уже выполнена", Задача);
		Сообщение.КлючДанных = Задача;
		Сообщение.ПутьКДанным = "Выполнена";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли; 
	
	Если ВыборкаДетальныеЗаписи.Исполнитель = ПараметрыСеанса.ТекущийСотрудник Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Задача %1 уже принята к исполнению вами", Задача);
		Сообщение.КлючДанных = Задача;
		Сообщение.ПутьКДанным = "Исполнитель";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	ЗадачаОбъект = Задача.ПолучитьОбъект();
	ЗадачаОбъект.Исполнитель = ПараметрыСеанса.ТекущийСотрудник;
	ЗадачаОбъект.Записать();

КонецПроцедуры

&НаКлиенте
Процедура ПринятьКИсполнению(Команда)
	
	ВыбраннаяЗадача = Элементы.Список.ТекущаяСтрока;
	
	Если ВыбраннаяЗадача = Неопределено Тогда
		Сообщение = "Не выбрана задача";
		Возврат;
	КонецЕсли;

	ПринятьКИсполнениюНаСервере(ВыбраннаяЗадача);
	
КонецПроцедуры                   





















