 
&НаКлиенте
Функция СуммаПоСтроке(Строка)
	
	Если АвтоматическаяСкидка Тогда
		Скидка = ЦеныВызовСервера.СкидкаНаДату(Строка.Номенклатура, Объект.Дата);
		Возврат Строка.Количество * Строка.Цена * (100 - Скидка) / 100; 
	ИначеЕсли Не АвтоматическаяСкидка Тогда
		Возврат Строка.Количество * Строка.Цена * (100 - Строка.Скидка) / 100;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ПриИзмененииНоменклатуры(ИзмененнаяСтрока)
	
	Если ИзмененнаяСтрока.Номенклатура <> Неопределено Тогда
		ТекущаяЦена = ЦеныВызовСервера.ЦенаНаДату(ИзмененнаяСтрока.Номенклатура, Объект.Дата);
		ИзмененнаяСтрока.Цена = ТекущаяЦена;
		ТекущаяСкидка = ЦеныВызовСервера.СкидкаНаДату(ИзмененнаяСтрока.Номенклатура, Объект.Дата);
		ИзмененнаяСтрока.Скидка = ТекущаяСкидка;
		ИзмененнаяСтрока.СтавкаНДС = ПолучитьСтавкуНДССервер(ИзмененнаяСтрока.Номенклатура);
		ПриИзмененииЦены(ИзмененнаяСтрока);
		ПриИзмененииСкидки(ИзмененнаяСтрока);
		ПриИзмененииСтавкиНДС(ИзмененнаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтавкуНДССервер(Номенклатура)
	Возврат Номенклатура.СтавкаНДС;
КонецФункции

&НаКлиенте
Процедура ПриИзмененииКоличества(ИзмененнаяСтрока)
	ИзмененнаяСтрока.Сумма = СуммаПоСтроке(ИзмененнаяСтрока);
	ПриИзмененииСуммы(ИзмененнаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЦены(ИзмененнаяСтрока)
	ИзмененнаяСтрока.Сумма = СуммаПоСтроке(ИзмененнаяСтрока);
	ПриИзмененииСуммы(ИзмененнаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСуммы(ИзмененнаяСтрока)
	ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
КонецПроцедуры


&НаКлиенте
Процедура ПриИзмененииСкидки(ИзмененнаяСтрока)
	АвтоматическаяСкидка = Ложь;
	ИзмененнаяСтрока.Сумма = СуммаПоСтроке(ИзмененнаяСтрока);
	ПриИзмененииСуммы(ИзмененнаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСтавкиНДС(ИзмененнаяСтрока)
	ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиСуммаПриИзменении(Элемент)
	ИзмененнаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	ПриИзмененииСуммы(ИзмененнаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиЦенаПриИзменении(Элемент)
	ИзмененнаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	ПриИзмененииЦены(ИзмененнаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиКоличествоПриИзменении(Элемент)
	ИзмененнаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	ПриИзмененииКоличества(ИзмененнаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиСтавкаНДСПриИзменении(Элемент)
	ИзмененнаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	ПриИзмененииСтавкиНДС(ИзмененнаяСтрока); 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиНоменклатураПриИзменении(Элемент)
	ИзмененнаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	ПриИзмененииНоменклатуры(ИзмененнаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	Подбор = Новый Структура;
	Подбор.Вставить("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", Подбор, Элементы.ТоварыИУслуги);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Для Каждого Строка Из Объект.ТоварыИУслуги Цикл
		Если Строка.Номенклатура = ВыбранноеЗначение Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	
	НоваяСтрока = Объект.ТоварыИУслуги.Добавить();
	НоваяСтрока.Номенклатура = ВыбранноеЗначение;
	ПриИзмененииНоменклатуры(НоваяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиСкидкаПриИзменении(Элемент)
	
	ИзмененнаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	ПриИзмененииСкидки(ИзмененнаяСтрока);
	
КонецПроцедуры







