
&НаКлиенте
Процедура ПриИзмененииНоменклатурыНоменклатурнойГруппы(ИзмененнаяСтрока)
	
	Если ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа <> Неопределено Тогда
		ТекущаяСкидка = ЦеныВызовСервера.СкидкаНаДату(ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа, Объект.Дата);
		ИзмененнаяСтрока.Скидка = ТекущаяСкидка;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СкидкиНоменклатураНоменклатурнаяГруппаПриИзменении(Элемент)
	ИзмененнаяСтрока = Элементы.Скидки.ТекущиеДанные;
	ПриИзмененииНоменклатурыНоменклатурнойГруппы(ИзмененнаяСтрока);
КонецПроцедуры

