
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	Дата = ТекущаяДата();
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВзаиморасчётыСКонтрагентами.Очистить();
	Движения.ВзаиморасчётыСКонтрагентами.Записать();
	Движения.ВзаиморасчётыСКонтрагентами.Записывать = Истина;
	Движения.Управленческий.Очистить();
	Движения.Управленческий.Записывать = Истина;

	
	//Проводка Дт62 Кт50 и Дт70 Кт50 и если тип Контрагент то записываем движение в регистр ВзаиморасчетыСКонтрагентами
	Проводка = Движения.Управленческий.Добавить();
	Проводка.Период = Дата;
	Проводка.СчетКт = ПланыСчетов.Управленческий.ДенежныеСредства;
	Проводка.Сумма = Сумма;
	
	Если ТипЗнч(Получатель) = Тип("СправочникСсылка.Контрагенты") Тогда
		Проводка.СчетДт = ПланыСчетов.Управленческий.РасчетыСПоставщиками;
		Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Получатель;
		
		Движение = Движения.ВзаиморасчётыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Получатель;
		Движение.Сумма = Сумма; 

	ИначеЕсли ТипЗнч(Получатель) = Тип("СправочникСсылка.Сотрудники") Тогда
		Проводка.СчетДт = ПланыСчетов.Управленческий.РасчетыССотрудниками;
		Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Сотрудники] = Получатель;
	КонецЕсли;
	
	
КонецПроцедуры


