
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Цены.Записывать = Истина;
		
	Для Каждого ТекСтрока Из Цены Цикл
		Движение = Движения.Цены.Добавить();
		Движение.Номенклатура = ТекСтрока.Номенклатура;
		Движение.Цена = ТекСтрока.Цена;
		Движение.Регистратор = Ссылка; 
		Движение.Период = Дата;
	КонецЦикла;	
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Дата = ТекущаяДата();
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	
КонецПроцедуры
