
&НаКлиенте
Процедура ПриИзмененииНоменклатуры(ИзмененнаяСтрока)
	
	Если ИзмененнаяСтрока.Номенклатура <> Неопределено Тогда
		ТекущаяЦена = ЦеныВызовСервера.ЦенаНаДату(ИзмененнаяСтрока.Номенклатура, Объект.Дата);
		ИзмененнаяСтрока.Цена = ТекущаяЦена;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНоменклатураПриИзменении(Элемент)
	
	ИзмененнаяСтрока = Элементы.Цены.ТекущиеДанные; 
	ПриИзмененииНоменклатуры(ИзмененнаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	Подбор = Новый Структура;
	Подбор.Вставить("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", Подбор, Элементы.Цены);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НоменклатураЕсть = Ложь;
	
	Для Каждого ТекСтрока Из Объект.Цены Цикл
		Если ТекСтрока.Номенклатура = ВыбранноеЗначение Тогда
			НоменклатураЕсть = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Не НоменклатураЕсть Тогда
		НоваяСтрока = Объект.Цены.Добавить();
		НоваяСтрока.Номенклатура = ВыбранноеЗначение;
		ПриИзмененииНоменклатуры(НоваяСтрока);
	КонецЕсли;
	
	
КонецПроцедуры


