
 &НаКлиенте
Процедура ПриИзмененииКоличества(ИзмененнаяСтрока)
	ИзмененнаяСтрока.Сумма = ИзмененнаяСтрока.Количество * ИзмененнаяСтрока.Цена;
	ПриИзмененииСуммы(ИзмененнаяСтрока)
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЦены(ИзмененнаяСтрока)
	ИзмененнаяСтрока.Сумма = ИзмененнаяСтрока.Количество * ИзмененнаяСтрока.Цена;
	ПриИзмененииСуммы(ИзмененнаяСтрока)
КонецПроцедуры

 &НаКлиенте
Процедура ПриИзмененииСуммы(ИзмененнаяСтрока)
	ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
	ИзмененнаяСтрока.Цена = ИзмененнаяСтрока.Сумма / ИзмененнаяСтрока.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСтавкиНДС(ИзмененнаяСтрока)
	ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиСуммаПриИзменении(Элемент)
	ИзмененнаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	ПриИзмененииСуммы(ИзмененнаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиЦенаПриИзменении(Элемент)
	ИзмененнаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	ПриИзмененииЦены(ИзмененнаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиКоличествоПриИзменении(Элемент)
	ИзмененнаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	ПриИзмененииКоличества(ИзмененнаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиСтавкаНДСПриИзменении(Элемент)
	ИзмененнаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	ПриИзмененииСтавкиНДС(ИзмененнаяСтрока);
КонецПроцедуры


