Функция ИННВерен(Знач ИНН) Экспорт 

	Если СтрДлина(ИНН) = 10 Тогда
		КонтрольнаяСумма = 0;
		Множитель = СтрРазделить("2,4,10,3,5,9,4,6,8", ",", Ложь);
		
		Для Сч = 1 По 9 Цикл
			КонтрольнаяСумма = КонтрольнаяСумма + Число(Сред(ИНН, Сч, 1)) * Число(Множитель[Сч - 1]);
		КонецЦикла;
		
		КонтрольныйРазряд = КонтрольнаяСумма % 11;
		
		Если КонтрольныйРазряд = 10 Тогда
			КонтрольныйРазряд = 0;
		КонецЕсли;
		Возврат КонтрольныйРазряд = Число(Сред(ИНН, 10, 1));
		
	ИначеЕсли СтрДлина(ИНН) = 12 Тогда
		КонтрольнаяСумма11 = 0;
		Множитель = СтрРазделить("7,2,4,10,3,5,9,4,6,8,0", ",", Ложь);
		
		Для Сч = 1 По 11 Цикл
			КонтрольнаяСумма11 = КонтрольнаяСумма11 + Число(Сред(ИНН, Сч, 1)) * Число(Множитель[Сч - 1]);
		КонецЦикла; 
		КонтрольноеЧисло1 = КонтрольнаяСумма11 % 11;
		Если КонтрольноеЧисло1 > 9 Тогда
			КонтрольноеЧисло1 = КонтрольноеЧисло1 % 10;
		КонецЕсли;
		
		КонтрольнаяСумма12 = 0;
		Множитель = СтрРазделить("3,7,2,4,10,3,5,9,4,6,8,0", ",", Ложь);
		
		Для Сч = 1 По 12 Цикл
			КонтрольнаяСумма12 = КонтрольнаяСумма12 + Число(Сред(ИНН, Сч, 1)) * Число(Множитель[Сч - 1]);
		КонецЦикла; 
		КонтрольноеЧисло2 = КонтрольнаяСумма12 % 11;
		Если КонтрольноеЧисло2 > 9 Тогда
			КонтрольноеЧисло2 = КонтрольноеЧисло2 % 10;
		КонецЕсли;
		Возврат (КонтрольноеЧисло1 = Число(Сред(ИНН, 11, 1))) И (КонтрольноеЧисло2 = Число(Сред(ИНН, 12, 1)));
	КонецЕсли;

КонецФункции
