
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Дата = ТекущаяДата();
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Скидки.Записывать = Истина;
	
	Для Каждого ТекСтрока Из Скидки Цикл
		Движение = Движения.Скидки.Добавить();
		Движение.Период = Дата;
		Движение.Регистратор = Ссылка;
		Движение.НоменклатураНоменклатурнаяГруппа = ТекСтрока.НоменклатураНоменклатурнаяГруппа;
		Движение.Скидка = ТекСтрока.Скидка;
	КонецЦикла;
	
	
КонецПроцедуры

